hey-report/redis_c_1000_n_100000_t_10_nginx_server_2.txt

Summary:
  Total:	260.6466 secs
  Slowest:	9.9965 secs
  Fastest:	0.0085 secs
  Average:	1.2954 secs
  Requests/sec:	383.6613
  
  Total data:	26544299 bytes
  Size/request:	294 bytes

Response time histogram:
  0.008 [1]	|
  1.007 [13608]	|■■■■■■■■
  2.006 [70972]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.005 [4937]	|■■■
  4.004 [348]	|
  5.002 [26]	|
  6.001 [136]	|
  7.000 [107]	|
  7.999 [5]	|
  8.998 [18]	|
  9.996 [115]	|


Latency distribution:
  10% in 0.7802 secs
  25% in 1.1105 secs
  50% in 1.2590 secs
  75% in 1.4035 secs
  90% in 1.7132 secs
  95% in 2.1483 secs
  99% in 2.9335 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0085 secs, 9.9965 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0001 secs, 0.0000 secs, 0.1147 secs
  resp wait:	1.2938 secs, 0.0083 secs, 9.9960 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0173 secs

Status code distribution:
  [200]	90273 responses

Error distribution:
  [278]	Get "http://0.0.0.0:8080/api/v1/leaderboard": EOF
  [9430]	Get "http://0.0.0.0:8080/api/v1/leaderboard": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
  [5]	Get "http://0.0.0.0:8080/api/v1/leaderboard": dial tcp 0.0.0.0:8080: connect: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51750->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51751->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51752->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51753->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51754->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51755->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51756->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51759->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51766->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51769->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51771->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51772->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51773->127.0.0.1:8080: read: connection reset by peer
  [1]	Get "http://0.0.0.0:8080/api/v1/leaderboard": read tcp 127.0.0.1:51774->127.0.0.1:8080: read: connection reset by peer